In [1]:
import numpy as np
import pandas as pd
from datetime import datetime

In [10]:
#Order of construction of a datetime object:
my_year = 2015
my_month = 1
my_day = 1
my_hour = 2
my_minute = 30
my_second = 15

In [11]:
# January 2nd, 2017
my_date = datetime(my_year, my_month, my_day)

In [12]:
my_date

datetime.datetime(2015, 1, 1, 0, 0)

In [13]:
# January 2nd, 2017 at 13:30:15
my_date_time = datetime(my_year,my_month,my_day,my_hour,my_minute,my_second)

In [14]:
my_date_time

datetime.datetime(2015, 1, 1, 2, 30, 15)

You can grab any part of the datetime you want

In [15]:
my_date.day

1

In [17]:
my_date_time.hour

2

## Converting to datetime
Often when data sets are stored, the time component may be a string. Pandas easily converts strings to datetime objects.

In [18]:
# For example, we have dates on multiple formats as follows:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])

In [19]:
myser

0    Nov 3, 2000
1     2000-01-01
2           None
dtype: object

In [20]:
myser[0]

'Nov 3, 2000'

In [21]:
# Simply use the to_datetime method to convert the strings to datetime objects
pd.to_datetime(myser)

0   2000-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [22]:
pd.to_datetime(myser)[0]

Timestamp('2000-11-03 00:00:00')

In [23]:
obvi_euro_date = '31-12-2000'

In [24]:
pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [25]:
# If the day is first (american time? european time format?)
euro_date = '10-12-2000'

In [26]:
pd.to_datetime(euro_date)

Timestamp('2000-10-12 00:00:00')

In [27]:
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [29]:
style_date = '12--Dec--2000'

In [30]:
# Pass to datetime specifying the format:
pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [31]:
strange_date = '12th of Dec 2000'

In [32]:
pd.to_datetime(strange_date)

Timestamp('2000-12-12 00:00:00')

## Data

In [34]:
sales = pd.read_csv('/home/legacy/anaconda3/Data Science Master Class/UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/RetailSales_BeerWineLiquor.csv')

In [35]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

Another way of loading a csv, converting to datetimes directly is as follows:

In [38]:
sales = pd.read_csv('/home/legacy/anaconda3/Data Science Master Class/UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/RetailSales_BeerWineLiquor.csv', parse_dates=[0])

In [39]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [41]:
sales['DATE'] # Now, it is a datetime type

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [42]:
sales = sales.set_index("DATE")

In [44]:
sales.resample(rule='A').mean() # Grouped by year, and mean applied

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

## .dt Method Calls
You can access datetime objects with pandas too using the .dt method

In [45]:
sales = sales.reset_index()